class NotificationMessagesTemplates:
    USING_POMOGATOR_GRATITUDE: str = (
        "\nПривет! 😃\n"
        "Спасибо тебе за использование канала Pomogator.\n"
        "В знак благодарности мы предоставляем тебе возможность бесплатно "
        "опубликовать свое объявление в нашем боте на месяц. Просто создай "
        "объявление во вкладке <b>Мои объявления</b>, и оно будет доступно "
        "для поиска ученикам.\n"
        "С наилучшими пожеланиями,\n"
        "команда UPGrade 🤗\n                    "
    )


class NotificationsTexts:
    TITLE = "Уведомления"
    DELETE_MESSAGE_BTN = "Удалить уведомление"
    DELETE_SUCCESS = "Уведомление удалено."
    NOT_FOUND = "Уведомление уже удалено или недоступно."
    NEW_MESSAGE_PREFIX = "📥 <b>НОВОЕ СООБЩЕНИЕ</b> 📥\n\n"
